load-testing/Express.txt
--------------------------------------
Metrics for period to: 20:39:50(+0300) (width: 9.994s)
--------------------------------------

http.codes.200: ................................................................ 732
http.codes.201: ................................................................ 283
http.codes.204: ................................................................ 293
http.request_rate: ............................................................. 120/sec
http.requests: ................................................................. 1180
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 6429
  median: ...................................................................... 106.7
  p95: ......................................................................... 6064.7
  p99: ......................................................................... 6187.2
http.responses: ................................................................ 1308
vusers.completed: .............................................................. 293
vusers.created: ................................................................ 165
vusers.created_by_name.0: ...................................................... 165
vusers.session_length:
  min: ......................................................................... 11210.2
  max: ......................................................................... 12175.8
  median: ...................................................................... 11734.2
  p95: ......................................................................... 11971.2
  p99: ......................................................................... 11971.2


--------------------------------------
Metrics for period to: 20:40:00(+0300) (width: 4.5s)
--------------------------------------

http.codes.200: ................................................................ 266
http.codes.201: ................................................................ 47
http.codes.204: ................................................................ 217
http.request_rate: ............................................................. 75/sec
http.requests: ................................................................. 313
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 6102
  median: ...................................................................... 135.7
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 6064.7
http.responses: ................................................................ 530
vusers.completed: .............................................................. 217
vusers.session_length:
  min: ......................................................................... 9011.9
  max: ......................................................................... 12042.5
  median: ...................................................................... 10832
  p95: ......................................................................... 11971.2
  p99: ......................................................................... 11971.2


All VUs finished. Total time: 3 minutes, 34 seconds

--------------------------------
Summary report @ 20:39:55(+0300)
--------------------------------

http.codes.200: ................................................................ 12240
http.codes.201: ................................................................ 4080
http.codes.204: ................................................................ 4080
http.request_rate: ............................................................. 125/sec
http.requests: ................................................................. 20400
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 6429
  median: ...................................................................... 122.7
  p95: ......................................................................... 5168
  p99: ......................................................................... 5944.6
http.responses: ................................................................ 20400
vusers.completed: .............................................................. 4080
vusers.created: ................................................................ 4080
vusers.created_by_name.0: ...................................................... 4080
vusers.session_length:
  min: ......................................................................... 266.4
  max: ......................................................................... 12175.8
  median: ...................................................................... 4492.8
  p95: ......................................................................... 11734.2
  p99: ......................................................................... 11971.2