load-testing/Fastify.txt
--------------------------------------
Metrics for period to: 20:32:20(+0300) (width: 9.993s)
--------------------------------------

http.codes.200: ................................................................ 618
http.codes.201: ................................................................ 247
http.codes.204: ................................................................ 257
http.request_rate: ............................................................. 104/sec
http.requests: ................................................................. 982
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 5482
  median: ...................................................................... 117.9
  p95: ......................................................................... 5272.4
  p99: ......................................................................... 5378.9
http.responses: ................................................................ 1122
vusers.completed: .............................................................. 257
vusers.created: ................................................................ 117
vusers.created_by_name.0: ...................................................... 117
vusers.session_length:
  min: ......................................................................... 9823.6
  max: ......................................................................... 10770.1
  median: ...................................................................... 10407.3
  p95: ......................................................................... 10617.5
  p99: ......................................................................... 10832


--------------------------------------
Metrics for period to: 20:32:30(+0300) (width: 2.442s)
--------------------------------------

http.codes.200: ................................................................ 144
http.codes.204: ................................................................ 147
http.request_rate: ............................................................. 67/sec
http.requests: ................................................................. 144
http.response_time:
  min: ......................................................................... 50
  max: ......................................................................... 4807
  median: ...................................................................... 115.6
  p95: ......................................................................... 4770.6
  p99: ......................................................................... 4770.6
http.responses: ................................................................ 291
vusers.completed: .............................................................. 147
vusers.session_length:
  min: ......................................................................... 7911.2
  max: ......................................................................... 10393.5
  median: ...................................................................... 9047.6
  p95: ......................................................................... 10201.2
  p99: ......................................................................... 10407.3


All VUs finished. Total time: 3 minutes, 33 seconds

--------------------------------
Summary report @ 20:32:23(+0300)
--------------------------------

http.codes.200: ................................................................ 12130
http.codes.201: ................................................................ 4037
http.codes.204: ................................................................ 4035
http.request_rate: ............................................................. 125/sec
http.requests: ................................................................. 20224
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 5482
  median: ...................................................................... 82.3
  p95: ......................................................................... 4403.8
  p99: ......................................................................... 5168
http.responses: ................................................................ 20202
vusers.completed: .............................................................. 4035
vusers.created: ................................................................ 4057
vusers.created_by_name.0: ...................................................... 4057
vusers.session_length:
  min: ......................................................................... 273.5
  max: ......................................................................... 10770.1
  median: ...................................................................... 3605.5
  p95: ......................................................................... 10201.2
  p99: ......................................................................... 10617.5